In [27]:
import numpy as np
import pandas as pd

In [28]:
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [29]:
train_df = pd.read_csv('train.csv')

In [30]:
test_df = pd.read_csv('test.csv')

In [31]:
features_df = pd.read_csv('features.csv')

In [32]:
stores_df = pd.read_csv('stores.csv')

In [33]:
train_df['Date'] = pd.to_datetime(train_df['Date'])

In [34]:
test_df['Date'] = pd.to_datetime(test_df['Date'])

In [35]:
features_df['Date'] = pd.to_datetime(features_df['Date'])

In [10]:
#train_new = pd.merge(train_df, features_df, on=['Store', 'Date', 'IsHoliday'], how = 'left')

In [11]:
#train_new = pd.merge(train_new, stores_df, on='Store', how = 'left')

In [36]:
train_df.head()

   Store  Dept       Date  Weekly_Sales  IsHoliday
0      1     1 2010-02-05      24924.50      False
1      1     1 2010-02-12      46039.49       True
2      1     1 2010-02-19      41595.55      False
3      1     1 2010-02-26      19403.54      False
4      1     1 2010-03-05      21827.90      False

### Min, max, mean, median, std of sales 3 Weeks before your date per department / store

In [21]:
## Previous 3 Weeks (lag)

train_df['t-3'] = train_df['Weekly_Sales'].shift(3)

In [22]:
train_df.head()

   Store  Dept       Date  Weekly_Sales  IsHoliday       t-3
0      1     1 2010-02-05      24924.50      False       NaN
1      1     1 2010-02-12      46039.49       True       NaN
2      1     1 2010-02-19      41595.55      False       NaN
3      1     1 2010-02-26      19403.54      False  24924.50
4      1     1 2010-03-05      21827.90      False  46039.49

In [20]:
#train_df[train_df['Store']==1]

In [34]:
## Min for previous 3 Weeks

#weekly_sales.loc[:,'Min_t-3'] = weekly_sales['Weekly_Sales'].shift(1).rolling(window=3).min()
#train_df['Min_t-3'] = train_df['Weekly_Sales'].shift(1).rolling(window=3).min()

In [35]:
## Mean, median, min and max for previous 3 weeks

#train_df['Max_t-3'] = train_df['Weekly_Sales'].shift(1).rolling(window=3).max()
#train_df['Mean_t-3'] = train_df['Weekly_Sales'].shift(1).rolling(window=3).mean()
#train_df['Median_t-3'] = train_df['Weekly_Sales'].shift(1).rolling(window=3).median()

In [36]:
#train_df.head()

,Store,Dept,Date,Weekly_Sales,IsHoliday,t-3,Min_t-3,Max_t-3,Mean_t-3,Median_t-3
0,1,1,2010-02-05,24924.50,False,NaN,NaN,NaN,NaN,NaN
1,1,1,2010-02-12,46039.49,True,NaN,NaN,NaN,NaN,NaN
2,1,1,2010-02-19,41595.55,False,NaN,NaN,NaN,NaN,NaN
3,1,1,2010-02-26,19403.54,False,24924.50,24924.50,46039.49,37519.846667,41595.55
4,1,1,2010-03-05,21827.90,False,46039.49,19403.54,46039.49,35679.526667,41595.55

In [42]:
#def create_feaures(df):
#train_df.groupby(['Store', 'Dept']).apply(lambda x:create_features(df))

In [250]:
testfunc = train_df.head(10).copy()

In [251]:
testfunc

   Store  Dept       Date  Weekly_Sales  IsHoliday
0      1     1 2010-02-05      24924.50      False
1      1     1 2010-02-12      46039.49       True
2      1     1 2010-02-19      41595.55      False
3      1     1 2010-02-26      19403.54      False
4      1     1 2010-03-05      21827.90      False
5      1     1 2010-03-12      21043.39      False
6      1     1 2010-03-19      22136.64      False
7      1     1 2010-03-26      26229.21      False
8      1     1 2010-04-02      57258.43      False
9      1     1 2010-04-09      42960.91      False

In [185]:
#testfunc['t10'] = testfunc[['Weekly_Sales']].apply(create_features,axis=1)

In [336]:
testfunc['t-1'] = testfunc['Weekly_Sales'].shift(1)

In [337]:
testfunc

   Store  Dept       Date  Weekly_Sales  IsHoliday       t-1
0      1     1 2010-02-05      24924.50      False       NaN
1      1     1 2010-02-12      46039.49       True  24924.50
2      1     1 2010-02-19      41595.55      False  46039.49
3      1     1 2010-02-26      19403.54      False  41595.55
4      1     1 2010-03-05      21827.90      False  19403.54
5      1     1 2010-03-12      21043.39      False  21827.90
6      1     1 2010-03-19      22136.64      False  21043.39
7      1     1 2010-03-26      26229.21      False  22136.64
8      1     1 2010-04-02      57258.43      False  26229.21
9      1     1 2010-04-09      42960.91      False  57258.43

In [189]:
testfunc['Shift_1'] = testfunc.groupby(['Store'])['Weekly_Sales'].transform(lambda x:x.shift(1))

In [191]:
testfunc.groupby(['Store'])['Weekly_Sales'].transform(lambda x:x.shift(1))

0         NaN
1    24924.50
2    46039.49
3    41595.55
4    19403.54
5    21827.90
6    21043.39
7    22136.64
8    26229.21
9    57258.43
Name: Weekly_Sales, dtype: float64

In [190]:
testfunc.head(10)

   Store  Dept       Date  Weekly_Sales  IsHoliday   Shift_1
0      1     1 2010-02-05      24924.50      False       NaN
1      1     1 2010-02-12      46039.49       True  24924.50
2      1     1 2010-02-19      41595.55      False  46039.49
3      1     1 2010-02-26      19403.54      False  41595.55
4      1     1 2010-03-05      21827.90      False  19403.54
5      1     1 2010-03-12      21043.39      False  21827.90
6      1     1 2010-03-19      22136.64      False  21043.39
7      1     1 2010-03-26      26229.21      False  22136.64
8      1     1 2010-04-02      57258.43      False  26229.21
9      1     1 2010-04-09      42960.91      False  57258.43

In [54]:
def stats(df):
    return pd.concat([df, df.shift(1), df.shift(2), df.shift(3)],axis=1)

In [153]:
testfunc.head()

   Store  Dept       Date  Weekly_Sales  IsHoliday
0      1     1 2010-02-05      24924.50      False
1      1     1 2010-02-12      46039.49       True
2      1     1 2010-02-19      41595.55      False
3      1     1 2010-02-26      19403.54      False
4      1     1 2010-03-05      21827.90      False

In [ ]:
def apply_and_concat(dataframe, field, func, column_names):
    return pd.concat((
        dataframe,
        dataframe[field].apply(
            lambda cell: pd.Series(func(cell), index=column_names))), axis=1)

In [82]:
def myfunc(df, field, func, cols):
    return pd.concat((df, df[field].apply(lambda cell: pd.Series(func(cell), index=cols))), axis = 1)

In [84]:
df = pd.DataFrame([1, 2, 3], index=['a', 'b', 'c'], columns=['A'])
print(df)

   A
a  1
b  2
c  3

In [85]:
def func(x):
    return x*x, x*x*x

In [88]:
myfunc(df, 'A', func, ['x^2', 'x^3'])

   A  x^2  x^3
a  1    1    1
b  2    4    8
c  3    9   27

In [141]:
def sales_stats(df, field1, field2, lag_func, cols):
    return pd.concat((df, df.groupby([field1])[field2].apply(lambda x: pd.Series(lag_func(x), index=cols))), axis = 1)

In [142]:
def lag_func(x):
    return x*10, x*20

In [144]:
#sales_stats(testfunc, 'Store', 'Weekly_Sales', lag_func, ['Lag_1', 'Lag_2'])

In [ ]:
testfunc.groupby(['Store'])['Weekly_Sales'].

testfunc['Weekly_Sales'].shift(1)

In [338]:
def ac(dataframe, field1, field2, fun1, column_names):
    return pd.concat((
        dataframe,
        dataframe.groupby([field1])[field2].apply(
            lambda cell: pd.Series(fun1(pd.Series(cell)), index=column_names))), axis=1)

In [339]:
def fun1(x):
    return x.shift(1)

In [341]:
#ac(testfunc, 'Store', 'Weekly_Sales', fun1, ['Times_100'])

In [383]:
def myfunc(df,f1,f2):
    return pd.concat((df, pd.Series(df.groupby([f1])[f2].shift(1)), 
                      pd.Series(df.groupby([f1])[f2].shift(2)),
                      pd.Series(df.groupby([f1])[f2].shift(3))
                     ),axis=1
                    )

In [384]:
myfunc(testfunc, 'Store', 'Weekly_Sales')

,Store,Dept,Date,Weekly_Sales,IsHoliday,t-1,Weekly_Sales,Weekly_Sales,Weekly_Sales
0,1,1,2010-02-05,24924.50,False,NaN,NaN,NaN,NaN
1,1,1,2010-02-12,46039.49,True,24924.50,24924.50,NaN,NaN
2,1,1,2010-02-19,41595.55,False,46039.49,46039.49,24924.50,NaN
3,1,1,2010-02-26,19403.54,False,41595.55,41595.55,46039.49,24924.50
4,1,1,2010-03-05,21827.90,False,19403.54,19403.54,41595.55,46039.49
5,1,1,2010-03-12,21043.39,False,21827.90,21827.90,19403.54,41595.55
6,1,1,2010-03-19,22136.64,False,21043.39,21043.39,21827.90,19403.54
7,1,1,2010-03-26,26229.21,False,22136.64,22136.64,21043.39,21827.90
8,1,1,2010-04-02,57258.43,False,26229.21,26229.21,22136.64,21043.39
9,1,1,2010-04-09,42960.91,False,57258.43,57258.43,26229.21,22136.64